#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/matthew-mccaskill-credera/learning-pod-lab2/runs/run-b5hS5HJTcf79Kh9K

Waiting for the plan to start...

Terraform v1.3.4
on linux_amd64
Initializing plugins and modules...
azurerm_resource_group.az_rg: Refreshing state... [id=/subscriptions/3451dd85-a66d-4d64-ba7d-45f48d8c4c23/resourceGroups/lab2-rg]
module.az_kv.data.azurerm_client_config.current: Reading...
module.az_kv.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD01M2Q3MzQ5Yy0yODkxLTQ3NTAtOTFmMC1lMTgzZjAwYTNkZWI7b2JqZWN0SWQ9OGVjOGJjNGItYWVhYi00OTJlLWFmNGYtMjQyMmI5YjRhNDBjO3N1YnNjcmlwdGlvbklkPTM0NTFkZDg1LWE2NmQtNGQ2NC1iYTdkLTQ1ZjQ4ZDhjNGMyMzt0ZW5hbnRJZD1kOTlhNmVkMi0wNDlhLTRkYTAtYjc1YS03YjViYTc5YWE5YTA=]
module.az_kv.data.azurerm_resource_group.this: Reading...
module.az_law.data.azurerm_resource_group.this: Reading...
module.az_law.data.azurerm_resource_group.this: Read complete after 0s [id=/subscriptions/3451dd85-a66d-4d64-ba7d-45f48d8c4c23/resourceGroups/lab2-rg]
module.az_kv.data.azurerm_resource_group.this: Read complete after 0s [id=/subscriptions/3451dd85-a66d-4d64-ba7d-45f48d8c4c23/resourceGroups/lab2-rg]
module.az_law.azurerm_log_analytics_workspace.this["DEMO"]: Refreshing state... [id=/subscriptions/3451dd85-a66d-4d64-ba7d-45f48d8c4c23/resourceGroups/lab2-rg/providers/Microsoft.OperationalInsights/workspaces/law-lab2-law-demo-production-centralus-demo]
module.az_kv.data.azurerm_log_analytics_workspace.this["DEMO"]: Reading...
module.az_kv.data.azurerm_log_analytics_workspace.this["DEMO"]: Read complete after 1s [id=/subscriptions/3451dd85-a66d-4d64-ba7d-45f48d8c4c23/resourceGroups/lab2-rg/providers/Microsoft.OperationalInsights/workspaces/law-lab2-law-demo-production-centralus-demo]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.az_law.azurerm_log_analytics_workspace.this["DEMO"] has changed
  ~ resource "azurerm_log_analytics_workspace" "this" {
        id                         = "/subscriptions/3451dd85-a66d-4d64-ba7d-45f48d8c4c23/resourceGroups/lab2-rg/providers/Microsoft.OperationalInsights/workspaces/law-lab2-law-demo-production-centralus-demo"
        name                       = "law-lab2-law-demo-production-centralus-demo"
      + tags                       = {}
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.az_kv.azurerm_key_vault.this["DEMO"] will be created
  + resource "azurerm_key_vault" "this" {
      + access_policy                 = (known after apply)
      + id                            = (known after apply)
      + location                      = "centralus"
      + name                          = "kv-lab2-demo-production"
      + public_network_access_enabled = true
      + resource_group_name           = "lab2-rg"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 90
      + tenant_id                     = "d99a6ed2-049a-4da0-b75a-7b5ba79aa9a0"
      + vault_uri                     = (known after apply)

      + network_acls {
          + bypass                     = (known after apply)
          + default_action             = (known after apply)
          + ip_rules                   = (known after apply)
          + virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.az_kv.module.monitor_diagnostic_settings["DEMO"].azurerm_monitor_diagnostic_setting.mds1 will be created
  + resource "azurerm_monitor_diagnostic_setting" "mds1" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/3451dd85-a66d-4d64-ba7d-45f48d8c4c23/resourceGroups/lab2-rg/providers/Microsoft.OperationalInsights/workspaces/law-lab2-law-demo-production-centralus-demo"
      + name                       = "mds-lab2-mds-demo-production"
      + target_resource_id         = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.


------------------------------------------------------------------------

Cost Estimation:

Resources: 0 of 3 estimated
           $0.0/mo +$0.0

```

</details>

*Pushed by: @matthew-mccaskill-credera, Action: `pull_request`*